dataframe is like excel sheet

In [6]:
# create a dataframe

import pandas as pd
data = {'a': [20,30,25], 'b': [60,43,65]}
x = pd.DataFrame(data)
x

    a   b
0  20  60
1  30  43
2  25  65

In [7]:
type(x)

pandas.core.frame.DataFrame

In [9]:
# specifying the column order

x = pd.DataFrame(data, columns=['b','a'])
x

    b   a
0  60  20
1  43  30
2  65  25

In [10]:
# custom indices
x = pd.DataFrame(data, index=['x','y','z'])
x

    a   b
x  20  60
y  30  43
z  25  65

In [11]:
x.loc['y']

a    30
b    43
Name: y, dtype: int64

In [13]:
data = {'1':[20,30,40],'2':[100,200,300]}
x = pd.DataFrame(data, index=['a','b','c'], columns=['1','2','3'])
x

    1    2    3
a  20  100  NaN
b  30  200  NaN
c  40  300  NaN

In [14]:
x['3'] = [1,2,3]
x

    1    2  3
a  20  100  1
b  30  200  2
c  40  300  3

In [16]:
col = pd.Series([-1,-2,-3],index=['a','b','c'])
x['new']=col
x

    1    2  3  4  new
a  20  100  1  3   -1
b  30  200  2  4   -2
c  40  300  3  5   -3

In [21]:
# Creating from a dictionary of dictionaries

data = {'OH':{2001:3,2002:5,2003:7}, 'CA':{2001:4,2002:33,2003:6}}
x=pd.DataFrame(data)
x

      OH  CA
2001   3   4
2002   5  33
2003   7   6

In [23]:
# Transposing a dataframe (Swapping the rows and columns)
# use .T
x2=x.T
x2

    2001  2002  2003
OH     3     5     7
CA     4    33     6